Repository: PlugaruT/pwned-checker
Catalog: po/*.po
Languages: fr, nl

source: Check if your password has been leaked
nl: Controleer of je wachtwoord uitgelekt is

source: Simple application for checking if a password has appeared in a leak. haveibeenpwned.com database is used.
fr: Une simple application pour vérifier si un mot de passe est apparu dans une fuite. La base de données haveibeenpwned.com est utilisée.
nl: Eenvoudige app om te controleren of je wachtwoord is uitgelekt. Hiervoor wordt gebruikgemaakt van de databank van haveibeenpwned.com.

source: Add French translations
fr: Ajout des traductions françaises
nl: Franse vertaling toegevoegd

source: Translate application description in AppCenter
fr: Traduction de la description de l'application dans le Centre d'Applications
nl: Appomschrijving in AppCenter is vertaalbaar gemaakt

source: Handle bad response from API
fr: Gestion des mauvaises réponses depuis l'API
nl: Afhandeling van verkeerd API-antwoord

source: Bug fixes
fr: Corrections de bugs
nl: Foutoplossingen

source: Juno Release
fr: Version pour Juno
nl: Juno-uitgave

source: Animate spinner when doing HTTP requests
nl: Spinner beweegt tijdens HTTP-verzoeken

source: Implement password searching by SHA-1
nl: Wachtwoorden zoeken via SHA-1 toegevoegd

source: Improve application icon
nl: App-pictogram verbeterd

source: Bug fixes.
fr: Corrections de bugs
nl: Foutoplossingen

source: Fix appdata file
nl: Appdata-bestand gerepareerd

source: Update screenshots
nl: Schermafdrukken bijgewerkt

source: Initial Release to AppCenter
fr: Version initiale pour le Centre d'Applications
nl: Initiële uitgave in het AppCenter

source: Check password or email
nl: Controleer wachtwoord of e-mailadres

source: Fixes
fr: Corrections
nl: Foutoplossingen

source: Fix missing dependencies
nl: Ontbrekende afhankelijkheden opgelost

source: Fix bug in debian files
nl: Fout opgelost in Debian-bestanden

source: Add app icon
fr: Ajout de l'icône d'application
nl: App-pictogram toegevoegd

source: First Release
fr: Première version
nl: Eerste uitgave

source: Application for interacting with haveibeenpwned.com API
fr: Application pour interagir avec l'API de haveibeenpwned.com
nl: App voor het benaderen van haveibeenpwned.com via de API

source: Password;Privacy;Security;
fr: Mot de passe;Confidentialité;Sécurité;
nl: Wachtwoord;Privacy;Beveiliging;

source: Check!
fr: Vérifier !
nl: Controleren!

source: Enter password to be checked!
fr: Entrez un mot de passe à vérifier !
nl: Voer het te controleren wachtwoord in!

source: Password
fr: Mot de passe
nl: Wachtwoord

source: Your password was pwned %s times!
fr: Votre mot de passe a fuité %s fois !
nl: Je wachtwoord is %s keer uitgelekt!

source: You can stay calm, the password is good!
fr: Vous pouvez rester calme, aucun problème avec ce mot de passe !
nl: Maar weest gerust: het wachtwoord is sterk!

source: Enter email to be checked!
fr: Entrez un e-mail à vérifier
nl: Voer het te controleren e-mailadres in!

source: Email
nl: E-mailadres

source: Your account was involved in %s breaches!
fr: Votre compte a été impliqué dans %s failles de sécurité !
nl: Je account is %s keer uitgelekt!

source: Congratulations, you were carefully enough !
fr: Félicitations, vous avez été assez prudent !
nl: Gefeliciteerd! Je bent voorzichtig genoeg geweest!

source: Please enter password or email you want to be checked on <a href='haveibeenpwned.com'>haveibeenpwned.com</a>
fr: Veuillez entrer un mot de passe ou un e-mail que vous voulez vérifier sur <a href='haveibeenpwned.com'>haveibeenpwned.com</a>
nl: Voer het wachtwoord of e-mailadres in dat je wilt controleren op <a href='haveibeenpwned.com'>haveibeenpwned.com</a>
